CSI API ETABS v1
cPropLink.GetDamperBilinear Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDamperBilinear(
	string Name,
	ref bool[] dof,
	ref bool[] Fixed,
	ref bool[] Nonlinear,
	ref double[] ke,
	ref double[] ce,
	ref double[] k,
	ref double[] c,
	ref double[] CY,
	ref double[] ForceLimit,
	ref double dj2,
	ref double dj3,
	ref string notes,
	ref string GUID
)
Function GetDamperBilinear (
	Name As String,
	ByRef dof As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Nonlinear As Boolean(),
	ByRef ke As Double(),
	ByRef ce As Double(),
	ByRef k As Double(),
	ByRef c As Double(),
	ByRef CY As Double(),
	ByRef ForceLimit As Double(),
	ByRef dj2 As Double,
	ByRef dj3 As Double,
	ByRef notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim dof As Boolean()
Dim Fixed As Boolean()
Dim Nonlinear As Boolean()
Dim ke As Double()
Dim ce As Double()
Dim k As Double()
Dim c As Double()
Dim CY As Double()
Dim ForceLimit As Double()
Dim dj2 As Double
Dim dj3 As Double
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetDamperBilinear(Name,
	dof, Fixed, Nonlinear, ke, ce, k, c,
	CY, ForceLimit, dj2, dj3, notes, GUID)
int GetDamperBilinear(
	String^ Name,
	array<bool>^% dof,
	array<bool>^% Fixed,
	array<bool>^% Nonlinear,
	array<double>^% ke,
	array<double>^% ce,
	array<double>^% k,
	array<double>^% c,
	array<double>^% CY,
	array<double>^% ForceLimit,
	double% dj2,
	double% dj3,
	String^% notes,
	String^% GUID
)
abstract GetDamperBilinear :
        Name : string *
        dof : bool[] byref *
        Fixed : bool[] byref *
        Nonlinear : bool[] byref *
        ke : float[] byref *
        ce : float[] byref *
        k : float[] byref *
        c : float[] byref *
        CY : float[] byref *
        ForceLimit : float[] byref *
        dj2 : float byref *
        dj3 : float byref *
        notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
dof
Type: System.Boolean[]
Fixed
Type: System.Boolean[]
Nonlinear
Type: System.Boolean[]
ke
Type: System.Double[]
ce
Type: System.Double[]
k
Type: System.Double[]
c
Type: System.Double[]
CY
Type: System.Double[]
ForceLimit
Type: System.Double[]
dj2
Type: System.Double
dj3
Type: System.Double
notes
Type: System.String
GUID
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropLink Interface
ETABSv1 Namespace